lessons/08-more-arrays.org
---
title: More Arrays
---

We're not done with arrays yet! Here, we will introduce two very common ways to use arrays: applying a single operation on each element of an array, and converting between arrays and strings.

** Higher-Order Functions
Methods that allow us to deal with an entire array as a whole, no matter how big, are invaluable for solving real problems. In order to do such a thing, we need to use *higher-order functions*. Keep in mind that methods are just functions with slightly different syntax, so we could call them *higher-order methods* but since this applies to functions in general, we'll stick to that.

A higher-order function is one that takes in a function as an argument. That's right, functions can take other functions as arguments! And why shouldn't they? After all, functions are values just like any other.

If you have heard of loops (e.g., the ~for~ loop, or the ~for...of~ loop), using these methods removes the need for writing our own loops. They do the looping internally (abstracting it) so we can focus on the problem at hand.

*** every()
The ~every()~ method checks if /every/ one of an array's elements passes a test and returns true if they all pass, otherwise false.

The argument we need to pass to ~every()~ is a function that takes in one element and returns a boolean value (true or false). We get to define the function and give it a name, but we don't get to decide how it gets called. That's the trick to higher-order functions. Since the higher-order function gets to call our function, it already has an idea in mind of how it's going to be called and what arguments to pass to it. So we can just imagine that our function's argument will become each element of the array.

In this case, ~every()~ is the higher order function. The function that we pass to it as an argument is called a *callback function*. The ~every()~ method is expecting the callback function to take a single argument and return a boolean value, so that's exactly how our callback function has to work.

#+BEGIN_SRC js
const isEven = x => x % 2 === 0;
console.log(isEven(2)); // true
console.log(isEven(5)); // false

const someNumbers = [1, 2, 3, 4, 5];
console.log(someNumbers.every(isEven)); // false

const evenNumbers = [2, 4, 6, 8];
console.log(evenNumbers.every(isEven)); // true
#+END_SRC

In this example, ~isEven()~ is our callback function. It takes a single argument, ~x~, and returns true if ~x~ is even, otherwise false. The argument ~x~ will become each element of the given array when ~every()~ runs, then we will get our final answer.

It is commonplace to define the callback function directly inside of the higher-order function call if we don't need to keep it for reuse.

#+BEGIN_SRC js
const evenNumbers = [2, 4, 6, 8];
console.log(evenNumbers.every(x => x % 2 === 0)); // true
#+END_SRC

How about checking if every name in an array starts with the letter 'A'?

#+BEGIN_SRC js
const names1 = ['Alice', 'Bob', 'Carol', 'Dave', 'Eve'];
console.log(names1.every(name => name.startsWith('A'))); // false

const names2 = ['Alice', 'Adam', 'April', 'Amy'];
console.log(names2.every(name => name.startsWith('A'))); // true

const names3 = ['Alice', 'Adam', 'April', 'Amy', 'Bob'];
console.log(names3.every(name => name.startsWith('A'))); // false
#+END_SRC

A whole category of problems just got a lot easier with ~every()~!

*** some()
The ~some()~ method is like ~every()~, except only /one/ element needs to pass the test to return true. In other words, if /any/ element passes the test, return true, otherwise false.

Let's take a look at similar examples as before, but using ~some()~ instead of ~every()~.

#+BEGIN_SRC js
const isEven = x => x % 2 === 0;

const someNumbers = [1, 2, 3, 4, 5];
console.log(someNumbers.some(isEven)); // true

const evenNumbers = [2, 4, 6, 8];
console.log(evenNumbers.some(isEven)); // true

const oddNumbers = [1, 3, 5, 7];
console.log(oddNumbers.some(isEven)); // false
#+END_SRC

#+BEGIN_SRC js
const names1 = ['Alice', 'Bob', 'Carol', 'Dave', 'Eve'];
console.log(names1.some(name => name.startsWith('A'))); // true

const names2 = ['Alice', 'Adam', 'April', 'Amy'];
console.log(names2.some(name => name.startsWith('A'))); // true

const names3 = ['Bob', 'Carol', 'Dave', 'Eve'];
console.log(names3.some(name => name.startsWith('A'))); // false
#+END_SRC

