08-more-arrays.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-25 Thu 13:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>More Arrays</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="highlight/styles/vs2015.css">
</head>
<body>
<div id="content">
<h1 class="title">More Arrays</h1>
<p>
<b><a href="index.html">Home</a></b>
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org91e1d96">1. More Arrays</a>
<ul>
<li><a href="#org15c3820">1.1. Higher-Order Functions</a></li>
</ul>
</li>
<li><a href="#orgc289d63">2. Exercises</a></li>
</ul>
</div>
</div>

<div id="outline-container-org91e1d96" class="outline-2">
<h2 id="org91e1d96"><span class="section-number-2">1</span> More Arrays</h2>
<div class="outline-text-2" id="text-1">
<p>
We're not done with arrays yet! Here, we will introduce two very common ways to use arrays: applying a single operation on each element of an array, and converting between arrays and strings.
</p>
</div>

<div id="outline-container-org15c3820" class="outline-3">
<h3 id="org15c3820"><span class="section-number-3">1.1</span> Higher-Order Functions</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Methods that allow us to deal with an entire array as a whole, no matter how big, are invaluable for solving real problems. In order to do such a thing, we need to use <b>higher-order functions</b>. Keep in mind that methods are just functions with slightly different syntax, so we could call them <b>higher-order methods</b> but since this applies to functions in general, we'll stick to that.
</p>

<p>
A higher-order function is one that takes in a function as an argument. That's right, functions can take other functions as arguments! And why shouldn't they? After all, functions are values just like any other.
</p>

<p>
If you have heard of loops (e.g., the <code>for</code> loop, or the <code>for...of</code> loop), using these methods removes the need for writing our own loops. They do the looping internally (abstracting it) so we can focus on the problem at hand.
</p>
</div>

<div id="outline-container-orga0f3dc0" class="outline-4">
<h4 id="orga0f3dc0"><span class="section-number-4">1.1.1</span> every()</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
The <code>every()</code> method checks if <i>every</i> one of an array's elements passes a test and returns true if they all pass, otherwise false.
</p>

<p>
The argument we need to pass to <code>every()</code> is a function that takes in one element and returns a boolean value (true or false). We get to define the function and give it a name, but we don't get to decide how it gets called. That's the trick to higher-order functions. Since the higher-order function gets to call our function, it already has an idea in mind of how it's going to be called and what arguments to pass to it. So we can just imagine that our function's argument will become each element of the array.
</p>

<p>
In this case, <code>every()</code> is the higher order function. The function that we pass to it as an argument is called a <b>callback function</b>. The <code>every()</code> method is expecting the callback function to take a single argument and return a boolean value, so that's exactly how our callback function has to work.
</p>

<div class="org-src-container">
<pre class="src src-js">const isEven = x =&gt; x % 2 === 0;
console.log(isEven(2)); // true
console.log(isEven(5)); // false

const someNumbers = [1, 2, 3, 4, 5];
console.log(someNumbers.every(isEven)); // false

const evenNumbers = [2, 4, 6, 8];
console.log(evenNumbers.every(isEven)); // true
</pre>
</div>

<p>
In this example, <code>isEven()</code> is our callback function. It takes a single argument, <code>x</code>, and returns true if <code>x</code> is even, otherwise false. The argument <code>x</code> will become each element of the given array when <code>every()</code> runs, then we will get our final answer.
</p>

<p>
It is commonplace to define the callback function directly inside of the higher-order function call if we don't need to keep it for reuse.
</p>

<div class="org-src-container">
<pre class="src src-js">const evenNumbers = [2, 4, 6, 8];
console.log(evenNumbers.every(x =&gt; x % 2 === 0)); // true
</pre>
</div>

<p>
How about checking if every name in an array starts with the letter 'A'?
</p>

<div class="org-src-container">
<pre class="src src-js">const names1 = ['Alice', 'Bob', 'Carol', 'Dave', 'Eve'];
console.log(names1.every(name =&gt; name.startsWith('A'))); // false

const names2 = ['Alice', 'Adam', 'April', 'Amy'];
console.log(names2.every(name =&gt; name.startsWith('A'))); // true

const names3 = ['Alice', 'Adam', 'April', 'Amy', 'Bob'];
console.log(names3.every(name =&gt; name.startsWith('A'))); // false
</pre>
</div>

<p>
A whole category of problems just got a lot easier with <code>every()</code>!
</p>
</div>
</div>

<div id="outline-container-org6574797" class="outline-4">
<h4 id="org6574797"><span class="section-number-4">1.1.2</span> some()</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
The <code>some()</code> method is like <code>every()</code>, except only <i>one</i> element needs to pass the test to return true. In other words, if <i>any</i> element passes the test, return true, otherwise false.
</p>

<p>
Let's take a look at similar examples as before, but using <code>some()</code> instead of <code>every()</code>.
</p>

<div class="org-src-container">
<pre class="src src-js">const isEven = x =&gt; x % 2 === 0;

const someNumbers = [1, 2, 3, 4, 5];
console.log(someNumbers.some(isEven)); // true

const evenNumbers = [2, 4, 6, 8];
console.log(evenNumbers.some(isEven)); // true

const oddNumbers = [1, 3, 5, 7];
console.log(oddNumbers.some(isEven)); // false
</pre>
</div>

<div class="org-src-container">
<pre class="src src-js">const names1 = ['Alice', 'Bob', 'Carol', 'Dave', 'Eve'];
console.log(names1.some(name =&gt; name.startsWith('A'))); // true

const names2 = ['Alice', 'Adam', 'April', 'Amy'];
console.log(names2.some(name =&gt; name.startsWith('A'))); // true

const names3 = ['Bob', 'Carol', 'Dave', 'Eve'];
console.log(names3.some(name =&gt; name.startsWith('A'))); // false
</pre>
</div>
</div>
</div>
