lessons/08-more-arrays.org
*** map()
Probably the most commonly used of the higher-order array methods is ~map()~. It takes in a function and returns a new array after having applied that function to each element. Because the function we provide to ~map()~ is meant to operate on each individual element of the array, we must define it as a function that takes one argument and returns a new value.

The kinds of problems that ~map()~ helps with are difficult to describe in words, so let's look at some examples.

Let's say we have an array of numbers:

#+BEGIN_SRC js
const someNumbers = [3, 99, 0, -6, 10];
#+END_SRC

And we want to increase each number by 1. We can first define a function that takes in a single number and returns its value plus 1.

#+BEGIN_SRC js
const add1 = x => x + 1;
console.log(add1(5)); // 6
#+END_SRC

We can try using this function on a single element of our array.

#+BEGIN_SRC js
console.log(add1(someNumbers[0])); // 4
#+END_SRC

If we want to apply the function to each element of our array, we could write it out the long way.

#+BEGIN_SRC js
console.log( [
  add1(someNumbers[0]),
  add1(someNumbers[1]),
  add1(someNumbers[2]),
  add1(someNumbers[3]),
  add1(someNumbers[4])
] ); // [ 4, 100, 1, -5, 11 ]
#+END_SRC

This works, but it requires us to know exactly how many element are in the array. And it would take a lot of code for a long array. Instead, we can use ~map()~.

#+BEGIN_SRC js
console.log(someNumbers.map(add1)); // [ 4, 100, 1, -5, 11 ]
#+END_SRC

As before, we can skip defining the add1 function as a variable and just define it in the ~map()~ call. The complete example is as follows.

#+BEGIN_SRC js
const someNumbers = [3, 99, 0, -6, 10];
console.log(someNumbers.map(x => x + 1)); // [ 4, 100, 1, -5, 11 ]
#+END_SRC

Another use case is to extract a common property from each element. Let's say we have an array of names and we want to get the lengths of each name. Since each name is a string and has a ~length~ property, we can use ~map()~ here.

#+BEGIN_SRC js
const names = ['Alice', 'Bob', 'Carol', 'Dean', 'Eve', 'Frank'];
const nameLengths = names.map(name => name.length);
console.log(nameLengths); // [ 5, 3, 5, 4, 3, 5 ]
#+END_SRC

In general, whenever we have some array ~xs~ and some function ~f~ (that operates on a single element ~x~), using ~xs.map(f)~ gives us ~[ f(xs[0]), f(xs[1]), f(xs[2]), ... ]~.

Map is the method to use if we want to:
- start with an array,
- do the same thing to each element of the array,
- and end up with a new array of the same size.

*** forEach()
The ~forEach()~ method is /exactly/ the same as ~map()~ except it doesn't return the new array. It takes in a function to operate on each element of the array, but it simply leaves it at that and doesn't return anything. This is used for when we want to perform some /action/ on each element instead of ending up with a new array. The simplest example of an action is printing, i.e. ~console.log()~.

#+BEGIN_SRC js
const names = ['Alice', 'Bob', 'Carol'];

const sayHello = name => {
  console.log(`Hello, ${name}!`);
};

names.forEach(sayHello);

// Without defining the function separately
names.forEach(name => {
  console.log(`Hello, ${name}!`);
});
#+END_SRC

Notice that our function does not return anything. Even if it did, the return value wouldn't be used because ~forEach()~ won't keep track of it.

Printing the lengths of an array of names just became easier!

#+BEGIN_SRC js
const names = ['Alice', 'Bob', 'Carol', 'Dean', 'Eve', 'Frank'];
names.forEach(name => console.log(name.length));
#+END_SRC

*** filter()
One of the less common, but still useful, higher-order array methods is ~filter()~. It also takes in a function to operate on each element of the array, except the function's job is to say whether to keep the element or not. After using ~filter()~, we end up with a new /filtered/ array that has only certain elements from the original array. Because we can only either keep an element or not, the callback function should return a boolean value (true or false). The new array will only have the elements for which the function returned true.

#+BEGIN_SRC js
const someNumbers = [3, 1, 2, 5, 6, 9, 8];

const isEven = num => num % 2 === 0; // returns true if num is even, otherwise false
console.log(someNumbers.filter(isEven)); // [ 2, 6, 8 ]

const isOdd = num => !isEven(num);
console.log(someNumbers.filter(isOdd)); // [ 3, 1, 5, 9 ]
#+END_SRC

We can filter our array of names in different ways.

#+BEGIN_SRC js
const names = ['Alice', 'Bob', 'Carol', 'Dean', 'Eve', 'Frank'];

console.log(names.filter(name => name.length <= 4)); // [ 'Bob', 'Dean', 'Eve' ]

console.log(names.filter(name => {
  return name.startsWith('A') || name.startsWith('E');
})); // [ 'Alice', 'Eve' ]
#+END_SRC

With a clever use of ~some()~, we can filter for names that start with some vowel.

#+BEGIN_SRC js
const names = ['Alice', 'Bob', 'Carol', 'Dean', 'Eve', 'Frank', 'Ingrid'];
const vowels = ['a', 'e', 'i', 'o', 'u'];

console.log(names.filter(name => {
  return vowels.some(vowel => name.toLowerCase().startsWith(vowel));
})); // [ 'Alice', 'Eve', 'Ingrid' ]
#+END_SRC

A common use of ~filter()~ is to check how many of a certain kind of element exists in an array. For example, how many numbers are even?

#+BEGIN_SRC js
const someNumbers = [3, 1, 2, 5, 6, 9, 8];
const isEven = num => num % 2 === 0;

console.log(someNumbers.filter(isEven).length); // 3
#+END_SRC

Filter is the method to use if we want to:
- start with an array,
- and end up with a new array of smaller or equal size as the original, without changing the elements.

