08-more-arrays.html

<div id="outline-container-orgbd53f6a" class="outline-4">
<h4 id="orgbd53f6a"><span class="section-number-4">1.1.3</span> map()</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Probably the most commonly used of the higher-order array methods is <code>map()</code>. It takes in a function and returns a new array after having applied that function to each element. Because the function we provide to <code>map()</code> is meant to operate on each individual element of the array, we must define it as a function that takes one argument and returns a new value.
</p>

<p>
The kinds of problems that <code>map()</code> helps with are difficult to describe in words, so let's look at some examples.
</p>
</div>

<ol class="org-ol">
<li><a id="org79430ad"></a>Example<br />
<div class="outline-text-5" id="text-1-1-3-1">
<p>
Let's say we have an array of numbers.
</p>

<div class="org-src-container">
<pre class="src src-js">const someNumbers = [3, 99, 0, -6, 10];
</pre>
</div>

<p>
And we want to increase each number by 1. We can first define a function that takes in a single number and returns its value plus 1.
</p>

<div class="org-src-container">
<pre class="src src-js">const add1 = x =&gt; x + 1;
console.log(add1(5)); // 6
</pre>
</div>

<p>
We can try using this function on a single element of our array.
</p>

<div class="org-src-container">
<pre class="src src-js">console.log(add1(someNumbers[0])); // 4
</pre>
</div>

<p>
If we want to apply the function to each element of our array, we could write it out the long way.
</p>

<div class="org-src-container">
<pre class="src src-js">console.log( [
  add1(someNumbers[0]),
  add1(someNumbers[1]),
  add1(someNumbers[2]),
  add1(someNumbers[3]),
  add1(someNumbers[4])
] ); // [ 4, 100, 1, -5, 11 ]
</pre>
</div>

<p>
This works, but it requires us to know exactly how many element are in the array. And it would take a lot of code for a long array. Instead, we can use <code>map()</code>.
</p>

<div class="org-src-container">
<pre class="src src-js">console.log(someNumbers.map(add1)); // [ 4, 100, 1, -5, 11 ]
</pre>
</div>

<p>
As before, we can skip defining the add1 function as a variable and just define it in the <code>map()</code> call. The complete example is as follows.
</p>

<div class="org-src-container">
<pre class="src src-js">const someNumbers = [3, 99, 0, -6, 10];
console.log(someNumbers.map(x =&gt; x + 1)); // [ 4, 100, 1, -5, 11 ]
</pre>
</div>
</div>
</li>

<li><a id="orge1e22b4"></a>Example<br />
<div class="outline-text-5" id="text-1-1-3-2">
<p>
Another use case is to extract a common property from each element. Let's say we have an array of names and we want to get the lengths of each name. Since each name is a string and has a <code>length</code> property, we can use <code>map()</code> here.
</p>

<div class="org-src-container">
<pre class="src src-js">const names = ['Alice', 'Bob', 'Carol', 'Dean', 'Eve', 'Frank'];
const nameLengths = names.map(name =&gt; name.length);
console.log(nameLengths); // [ 5, 3, 5, 4, 3, 5 ]
</pre>
</div>
</div>
</li>

<li><a id="orgb08333f"></a>Summary<br />
<div class="outline-text-5" id="text-1-1-3-3">
<p>
In general, whenever we have some array <code>xs</code> and some function <code>f</code> (that operates on a single element <code>x</code>), using <code>xs.map(f)</code> gives us <code>[ f(xs[0]), f(xs[1]), f(xs[2]), ... ]</code>.
</p>

<p>
Map is the method to use if we want to:
</p>
<ul class="org-ul">
<li>start with an array,</li>
<li>do the same thing to each element of the array,</li>
<li>and end up with a new array of the same size.</li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgbb02949" class="outline-4">
<h4 id="orgbb02949"><span class="section-number-4">1.1.4</span> forEach()</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
The <code>forEach()</code> method is <i>exactly</i> the same as <code>map()</code> except it doesn't return the new array. It takes in a function to operate on each element of the array, but it simply leaves it at that and doesn't return anything. This is used for when we want to perform some <i>action</i> on each element instead of ending up with a new array. The simplest example of an action is printing, i.e. <code>console.log()</code>.
</p>

<div class="org-src-container">
<pre class="src src-js">const names = ['Alice', 'Bob', 'Carol'];

const sayHello = name =&gt; {
  console.log(`Hello, ${name}!`);
};

names.forEach(sayHello);

// Without defining the function separately
names.forEach(name =&gt; {
  console.log(`Hello, ${name}!`);
});
</pre>
</div>

<p>
Notice that our function does not return anything. Even if it did, the return value wouldn't be used because <code>forEach()</code> won't keep track of it.
</p>

<p>
Printing the lengths of an array of names just became easier!
</p>

<div class="org-src-container">
<pre class="src src-js">const names = ['Alice', 'Bob', 'Carol', 'Dean', 'Eve', 'Frank'];
names.forEach(name =&gt; console.log(name.length));
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb54cae7" class="outline-4">
<h4 id="orgb54cae7"><span class="section-number-4">1.1.5</span> filter()</h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
One of the less common, but still useful, higher-order array methods is <code>filter()</code>. It also takes in a function to operate on each element of the array, except the function's job is to say whether to keep the element or not. After using <code>filter()</code>, we end up with a new <i>filtered</i> array that has only certain elements from the original array. Because we can only either keep an element or not, the callback function should return a boolean value (true or false). The new array will only have the elements for which the function returned true.
</p>

<div class="org-src-container">
<pre class="src src-js">const someNumbers = [3, 1, 2, 5, 6, 9, 8];

const isEven = num =&gt; num % 2 === 0; // returns true if num is even, otherwise false
console.log(someNumbers.filter(isEven)); // [ 2, 6, 8 ]

const isOdd = num =&gt; !isEven(num);
console.log(someNumbers.filter(isOdd)); // [ 3, 1, 5, 9 ]
</pre>
</div>

<p>
We can filter our array of names in different ways.
</p>

<div class="org-src-container">
<pre class="src src-js">const names = ['Alice', 'Bob', 'Carol', 'Dean', 'Eve', 'Frank'];

console.log(names.filter(name =&gt; name.length &lt;= 4)); // [ 'Bob', 'Dean', 'Eve' ]

console.log(names.filter(name =&gt; {
  return name.startsWith('A') || name.startsWith('E');
})); // [ 'Alice', 'Eve' ]
</pre>
</div>

<p>
With a clever use of <code>some()</code>, we can filter for names that start with some vowel.
</p>

<div class="org-src-container">
<pre class="src src-js">const names = ['Alice', 'Bob', 'Carol', 'Dean', 'Eve', 'Frank', 'Ingrid'];
const vowels = ['a', 'e', 'i', 'o', 'u'];

console.log(names.filter(name =&gt; {
  return vowels.some(vowel =&gt; name.toLowerCase().startsWith(vowel));
})); // [ 'Alice', 'Eve', 'Ingrid' ]
</pre>
</div>

<p>
A common use of <code>filter()</code> is to check how many of a certain kind of element exists in an array. For example, how many numbers are even?
</p>

<div class="org-src-container">
<pre class="src src-js">const someNumbers = [3, 1, 2, 5, 6, 9, 8];
const isEven = num =&gt; num % 2 === 0;

console.log(someNumbers.filter(isEven).length); // 3
</pre>
</div>

<p>
Filter is the method to use if we want to:
</p>
<ul class="org-ul">
<li>start with an array,</li>
<li>and end up with a new array of smaller or equal size as the original, without changing the elements.</li>
</ul>
</div>
</div>
