lessons/08-more-arrays.org
*** reduce()
If the previous methods are for handling certain kinds of problems with arrays, then ~reduce()~ is for everything else. Being a very expressive method, ~reduce()~ can be difficult to master but very useful.

The callback function passed to ~reduce()~ needs to take two arguments. Let's call them ~acc~ (short for "accumulator") and ~x~. Like the other methods, ~x~ will become each element of the array. ~acc~ gets an initial value, given by the argument after the callback function, then takes on the values of each successive result of the callback function. You can think of ~reduce()~ as starting with an array and reducing it to a single value (the last value of ~acc~). Some examples will make this more clear.

We don't yet have a way to sum a bunch of numbers in an array. A great use case for ~reduce()~.

#+BEGIN_SRC js
const someNumbers = [1, 2, 3, 4, 5];
console.log(someNumbers.reduce((acc, x) => acc + x, 0)); // 15
#+END_SRC

All we're doing here is adding each number to an accumulator until we reach the end. To break this down, we're giving ~reduce()~ two arguments: a callback function and the number 0. In our callback function, ~acc~ starts off as 0. The first call of our function uses the first element, 1, as the value for ~x~, so we get ~acc + x = 0 + 1 = 1~ as a result. Then the new value for ~acc~ is 1. Then ~x~ becomes the next element, 2. This time, we get ~acc + x = 1 + 2 = 3~ as a result. Then the new value for ~acc~ is 3. And repeat, ~x~ becomes 3. Now, ~acc + x = 3 + 3 = 6~. Then the new value for ~acc~ is 6. Repeat, ~x~ becomes 4. ~acc + x = 6 + 4 = 10~. Then the new value for ~acc~ is 10. Finally, ~x~ becomes 5. ~acc + x = 10 + 5 = 15~. Then the final value for ~acc~ is 15 and that is the final result because there are no more elements in the array.

Perhaps more clearly:

| acc |  x  |     acc + x |
|-----+-----+-------------|
| <l> | <c> |         <r> |
| 0   |  1  |   0 + 1 = 1 |
| 1   |  2  |   1 + 2 = 3 |
| 3   |  3  |   3 + 3 = 6 |
| 6   |  4  |  6 + 4 = 10 |
| 10  |  5  | 10 + 5 = 15 |
| 15  | N/A |         N/A |

#+BEGIN_EXPORT HTML
<br>
#+END_EXPORT

The result we end up with doesn't have to be the same type as the elements. For example, we can sum the lengths of an array of strings all at once:

#+BEGIN_SRC js
const names = ['Alice', 'Bob', 'Carol', 'Dave', 'Eve'];
console.log(names.reduce((acc, name) => acc + name.length, 0)); // 20
#+END_SRC

We can also end up with an array! For example, we can flatten a nested array:

#+BEGIN_SRC js
const nested = [ ['Alice', 'Bob'], ['Carol', 'Dave'] ];
console.log(nested.reduce((acc, x) => [...acc, ...x], []));
#+END_SRC

In fact, ~reduce()~ is so expressive that we can define all of the previous methods just by using it alone:

#+BEGIN_SRC js
const reduceEvery = (xs, f) => xs.reduce((acc, x) => acc ? f(x) : false, true);
console.log(reduceEvery([1, 2, 3, 4, 5], x => x % 2 === 0)); // false
console.log(reduceEvery([2, 4, 6, 8], x => x % 2 === 0)); // true

const reduceSome = (xs, f) => xs.reduce((acc, x) => acc ? true : f(x), false);
console.log(reduceSome([1, 2, 3, 4, 5], x => x % 2 === 0)); // true
console.log(reduceSome([1, 3, 5, 7], x => x % 2 === 0)); // false

const reduceMap = (xs, f) => xs.reduce((acc, x) => [...acc, f(x)], []);
console.log(reduceMap([1, 2, 3, 4, 5], x => x + 1)); // [ 2, 3, 4, 5, 6 ]
console.log(reduceMap(['Alice', 'Bob', 'Carol'], name => name.length)); // [ 5, 3, 5 ]

const reduceFilter = (xs, f) => xs.reduce((acc, x) => f(x) ? [...acc, x] : acc, []);
console.log(reduceFilter([1, 2, 3, 4, 5], x => x % 2 === 0)); // [ 2, 4 ]
console.log(reduceFilter(['Alice', 'Bob', 'Carol'], name => name.length < 4)); // [ 'Bob' ]
#+END_SRC

** Exercises

#+BEGIN_EXPORT HTML
<ul>
	<li><a href="/exercises/08-more-arrays-exercises.js">View exercises</a></li>
	<li><a href="/exercises/08-more-arrays-exercises.js" download type="application/octet-stream">Download exercises</a></li>
	<li><a href="/exercises/08-more-arrays-solutions.js">View solutions</a></li>
	<li><a href="/exercises/08-more-arrays-solutions.js" download type="application/octet-stream">Download solutions</a></li>
</ul>
#+END_EXPORT
