08-more-arrays.html

<div id="outline-container-orgb3f24f6" class="outline-4">
<h4 id="orgb3f24f6"><span class="section-number-4">1.1.6</span> reduce()</h4>
<div class="outline-text-4" id="text-1-1-6">
<p>
If the previous methods are for handling certain kinds of problems with arrays, then <code>reduce()</code> is for everything else. Being a very expressive method, <code>reduce()</code> can be difficult to master but very useful.
</p>

<p>
The callback function passed to <code>reduce()</code> needs to take two arguments. Let's call them <code>acc</code> (short for "accumulator") and <code>x</code>. Like the other methods, <code>x</code> will become each element of the array. <code>acc</code> gets an initial value, given by the argument after the callback function, then takes on the values of each successive result of the callback function. You can think of <code>reduce()</code> as starting with an array and reducing it to a single value (the last value of <code>acc</code>). Some examples will make this more clear.
</p>
</div>

<ol class="org-ol">
<li><a id="orgc691eb7"></a>Example<br />
<div class="outline-text-5" id="text-1-1-6-1">
<p>
We don't yet have a way to sum a bunch of numbers in an array. A great use case for <code>reduce()</code>.
</p>

<div class="org-src-container">
<pre class="src src-js">const someNumbers = [1, 2, 3, 4, 5];
console.log(someNumbers.reduce((acc, x) =&gt; acc + x, 0)); // 15
</pre>
</div>

<p>
All we're doing here is adding each number to an accumulator until we reach the end. To break this down, we're giving <code>reduce()</code> two arguments: a callback function and the number 0. In our callback function, <code>acc</code> starts off as 0. The first call of our function uses the first element, 1, as the value for <code>x</code>, so we get <code>acc + x = 0 + 1 = 1</code> as a result. Thus, the new value for <code>acc</code> is 1. Then <code>x</code> becomes the next element, 2. This time, we get <code>acc + x = 1 + 2 = 3</code> as a result. Thus, the new value for <code>acc</code> is 3. And repeat, <code>x</code> becomes 3. <code>acc + x = 3 + 3 = 6</code>. Thus, the new value for <code>acc</code> is 6. Repeat, <code>x</code> becomes 4. <code>acc + x = 6 + 4 = 10</code>. Thus, the new value for <code>acc</code> is 10. Finally, <code>x</code> becomes 5. <code>acc + x = 10 + 5 = 15</code>. Thus, the final value for <code>acc</code> is 15 and that is the final result.
</p>

<p>
Perhaps more clearly:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-center" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">acc</th>
<th scope="col" class="org-center">x</th>
<th scope="col" class="org-right">acc + x</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">0</td>
<td class="org-center">1</td>
<td class="org-right">0 + 1 = 1</td>
</tr>

<tr>
<td class="org-left">1</td>
<td class="org-center">2</td>
<td class="org-right">1 + 2 = 3</td>
</tr>

<tr>
<td class="org-left">3</td>
<td class="org-center">3</td>
<td class="org-right">3 + 3 = 6</td>
</tr>

<tr>
<td class="org-left">6</td>
<td class="org-center">4</td>
<td class="org-right">6 + 4 = 10</td>
</tr>

<tr>
<td class="org-left">10</td>
<td class="org-center">5</td>
<td class="org-right">10 + 5 = 15</td>
</tr>
</tbody>
</table>

<p>
.
</p>
</div>
</li>

<li><a id="org74b72c9"></a>Example<br />
<div class="outline-text-5" id="text-1-1-6-2">
<p>
The result we end up with doesn't even have to be the same type as the elements. For example, we can sum the lengths of an array of strings all at once.
</p>

<div class="org-src-container">
<pre class="src src-js">const names = ['Alice', 'Bob', 'Carol', 'Dave', 'Eve'];
console.log(names.reduce((acc, name) =&gt; acc + name.length, 0)); // 20
</pre>
</div>
</div>
</li>

<li><a id="orgf6919a5"></a>Example<br />
<div class="outline-text-5" id="text-1-1-6-3">
<p>
In fact, we can even end up with an array! For example, we can flatten a nested array.
</p>

<div class="org-src-container">
<pre class="src src-js">const nested = [ ['Alice', 'Bob'], ['Carol', 'Dave'] ];
console.log(nested.reduce((acc, x) =&gt; [...acc, ...x], []));
</pre>
</div>
</div>
</li>

<li><a id="org490e221"></a>Example<br />
<div class="outline-text-5" id="text-1-1-6-4">
<p>
In fact, <code>reduce()</code> is so expressive that we can define all of the previous methods just by using it alone.
</p>

<div class="org-src-container">
<pre class="src src-js">const reduceEvery = (xs, f) =&gt; xs.reduce((acc, x) =&gt; acc ? f(x) : false, true);
console.log(reduceEvery([1, 2, 3, 4, 5], x =&gt; x % 2 === 0)); // false
console.log(reduceEvery([2, 4, 6, 8], x =&gt; x % 2 === 0)); // true

const reduceSome = (xs, f) =&gt; xs.reduce((acc, x) =&gt; acc ? true : f(x), false);
console.log(reduceSome([1, 2, 3, 4, 5], x =&gt; x % 2 === 0)); // true
console.log(reduceSome([1, 3, 5, 7], x =&gt; x % 2 === 0)); // false

const reduceMap = (xs, f) =&gt; xs.reduce((acc, x) =&gt; [...acc, f(x)], []);
console.log(reduceMap([1, 2, 3, 4, 5], x =&gt; x + 1)); // [ 2, 3, 4, 5, 6 ]
console.log(reduceMap(['Alice', 'Bob', 'Carol'], name =&gt; name.length)); // [ 5, 3, 5 ]

const reduceFilter = (xs, f) =&gt; xs.reduce((acc, x) =&gt; f(x) ? [...acc, x] : acc, []);
console.log(reduceFilter([1, 2, 3, 4, 5], x =&gt; x % 2 === 0)); // [ 2, 4 ]
console.log(reduceFilter(['Alice', 'Bob', 'Carol'], name =&gt; name.length &lt; 4)); // [ 'Bob' ]
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgc289d63" class="outline-2">
<h2 id="orgc289d63"><span class="section-number-2">2</span> Exercises</h2>
<div class="outline-text-2" id="text-2">
<ul>
	<li><a href="08-more-arrays-exercises.js">View exercises</a></li>
	<li><a href="08-more-arrays-exercises.js" download type="application/octet-stream">Download exercises</a></li>
	<li><a href="08-more-arrays-solutions.js">View solutions</a></li>
	<li><a href="08-more-arrays-solutions.js" download type="application/octet-stream">Download solutions</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
